Revit 2027 API
ThemeType Enumeration
 The application frame theme Type.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ThemeType
Public Enumeration ThemeType
public enum class ThemeType
type ThemeType
Members
Member name | Value | Description
CanvasTheme | 0 |  CanvasTheme.
UITheme | 1 |  UITheme.
See Also
Reference
Autodesk.Revit.UI Namespace